Overview
This vulnerability sample was recently discovered by Qi An Xin Threat Intelligence Center during routine wild vulnerability monitoring operations. When first uploaded, it was detected by only 6 antivirus engines.

After analysis, it was confirmed that this vulnerability was fixed in Microsoft’s August patch. It is a fixed, previously unknown n-day exploit. The exact running effects are as described below.

Vulnerability Sample Analysis
First, let’s go through the entire sample. The sample starts by launching a cmd process, then calls the core function fun_vulstar.

fun_vulstar checks the current machine's related system version.

Next, it dynamically obtains addresses of some system API functions.

It creates a new thread to call the exploit function fun_expProc.

fun_expProc calls fun_IoRingandPipeinit.

This function checks whether the target system supports the I/O ring privilege escalation method. If supported, it completes the necessary initialization and returns var_ioringRegBuffers / var_ioringRegBuffersCount. The detailed exploitation mechanism can be referenced in the following article:
(https://windows-internals.com/one-i-o-ring-to-rule-them-all-a-full-read-write-exploit-primitive-on-windows-11/)


Eventually it calls PspExitThread. PspExitThread handles the following: it checks the current thread and obtains the kernel object corresponding to the ALPC port previously bound via NtRegisterThreadTerminatePort. Then through the function LpcRequestPort, it sends a message to the corresponding ALPC server (in the exploit code this is the PDC ALPC port service). The message content starts with 300008006, which is the aforementioned LPC_TERMINATION_MESSAGE.

LpcRequestPort is shown below; the final sending is done via AlpcpSendMessage. Actually, LPC is a mechanism for internal process communication before Windows Vista. After Vista, it was replaced by a more efficient ALPC. For compatibility, all LPC calls are essentially redirected to ALPC.

Our ALPC port handler here is actually the ALPC port corresponding to the PDC ALPC port service, and the driver is pdc.sys.

Upon entering PdcProcessMessage, there is a branch for handling LPC_TERMINATION_MESSAGE. It checks the exact position 6 of the message starting at offset +4 in 300008006 we just sent. PdcFreeClient will be used to free poi(poi(MessageAttribute)+0x20), and the freed location should then be occupied by exp and overwritten with malicious memory. In that malicious memory poi(poi(evil+0x20)+0x6c8) points to a var_KWorkerHandleaddr, which is then passed into KeSetEvent as poi(poi(poi(poi(MessageAttribute)+0x20)+0x20)+0x6c8) and modified.

The following questions need to be confirmed:

Is the freeing caused by PdcFreeClient and then reused?

If question 1 is true, what is this freed memory, how is it generated, and why is it not modified between the LPC_TERMINATION_MESSAGE sent by the system and the triggered message we sent via NtAlpcSendWaitReceivePort?

How is the memory occupation implemented? Our guess is NtCreateEvent, as the spray operation in the code related to NtCreateEvent is very obvious.

When the bound thread exits, triggering LpcRequestPort, the kernel sends a LPC_TERMINATION_MESSAGE starting with 300008 to the corresponding PDC ALPC port service.

The PDC ALPC port service handles received messages in pdc.sys's PdcpAlpcProcessMessages function. As stated before, messages in ALPC are routed by the kernel. Here ZwAlpcSendWaitReceivePort is called to receive the message. Because ZwAlpcSendWaitReceivePort specifies ReceiveMessageAttributes (v5), the kernel generates this data during routing, even if the actual sender does not send it.

Before calling ZwAlpcSendWaitReceivePort in PdcpAlpcProcessMessages, an object of ReceiveMessageAttributes is created through AlpcInitializeMessageAttribute.

The ZwAlpcSendWaitReceivePort call actually goes into the kernel's NtAlpcSendWaitReceivePort, and then into AlpcpReceiveMessage, which calls AlpcpReceiveMessagePort.

As shown below, the core of AlpcpReceiveMessagePort lies in returning the _KALPC_MESSAGE corresponding to the received message.

Here, the server connection port object is as follows.

The overall structure of nt!_ALPC_PORT is as follows:
0: kd> dt nt\!\_ALPC\_PORT
   +0x000 PortListEntry    : _LIST_ENTRY
   +0x010 CommunicationInfo : Ptr64 _ALPC_COMMUNICATION_INFO
   +0x018 OwnerProcess     : Ptr64 _EPROCESS
   +0x020 CompletionPort   : Ptr64 _KQUEUE
   +0x028 CompletionKey    : Ptr64 Void
   +0x030 CompletionPacketLookaside : Ptr64 _ALPC_COMPLETION_PACKET_LOOKASIDE
   +0x038 PortContext      : Ptr64 Void
   +0x040 StaticSecurity   : _SECURITY_CLIENT_CONTEXT
   +0x088 IncomingQueueLock : _EX_PUSH_LOCK
   +0x090 MainQueue        : _LIST_ENTRY
   +0x0a0 LargeMessageQueue : _LIST_ENTRY
   +0x0b0 PendingQueueLock : _EX_PUSH_LOCK
   +0x0b8 PendingQueue     : _LIST_ENTRY
   +0x0c8 DirectQueueLock  : _EX_PUSH_LOCK
   +0x0d0 DirectQueue      : _LIST_ENTRY
   +0x0e0 WaitQueueLock    : _EX_PUSH_LOCK
   +0x0e8 WaitQueue        : _LIST_ENTRY
   +0x0f8 Semaphore        : Ptr64 _KSEMAPHORE
   +0x0f8 DummyEvent       : Ptr64 _KEVENT
   +0x100 PortAttributes   : _ALPC_PORT_ATTRIBUTES
   +0x148 ResourceListLock : _EX_PUSH_LOCK
   +0x150 ResourceListHead : _LIST_ENTRY
   +0x160 PortObjectLock   : _EX_PUSH_LOCK
   +0x168 CompletionList   : Ptr64 _ALPC_COMPLETION_LIST
   +0x170 CallbackObject   : Ptr64 _CALLBACK_OBJECT
   +0x178 CallbackContext  : Ptr64 Void
   +0x180 CanceledQueue    : _LIST_ENTRY
   +0x190 SequenceNo       : Int4B
   +0x194 ReferenceNo      : Int4B
   +0x198 ReferenceNoWait  : Ptr64 _PALPC_PORT_REFERENCE_WAIT_BLOCK
   +0x1a0 u1               : <unnamed-tag>
   +0x1a8 TargetQueuePort  : Ptr64 _ALPC_PORT
   +0x1b0 TargetSequencePort : Ptr64 _ALPC_PORT
   +0x1b8 CachedMessage    : Ptr64 _KALPC_MESSAGE
   +0x1c0 MainQueueLength  : Uint4B
   +0x1c4 LargeMessageQueueLength : Uint4B
   +0x1c8 PendingQueueLength : Uint4B
   +0x1cc DirectQueueLength : Uint4B
   +0x1d0 CanceledQueueLength : Uint4B
   +0x1d4 WaitQueueLength  : Uint4B
AlpcpReceiveMessagePort retrieves messages from the MainQueue message queue inside the _ALPC_PORT object.

The messages in the queue are nt!_KALPC_MESSAGE objects. As shown below, the extracted message object's +0xf0 offset corresponds exactly to the sent 3000008 message entity.

The _KALPC_MESSAGE structure is as follows: starting at 0x68 is MessageAttributes, and at 0xf0 is the corresponding message entity.

Then some settings are applied to this _KALPC_MESSAGE, and execution jumps to Label_19.

Finally, AlpcpReceiveMessagePort returns this _KALPC_MESSAGE through the a4 parameter.

The returned _KALPC_MESSAGE is shown below.

Since ZwAlpcSendWaitReceivePort in PdcpAlpcProcessMessages sets the ReceiveMessageAttributes parameter (which corresponds to this a4), the function AlpcpExposeAttributes is called.

